<template>
  <section class="faq-section bg-gray-200 py-12">
    <div class="container mx-auto">
      <h2 class="text-5xl font-bold mb-8 text-center text-primary">Частые вопросы</h2>
      <div v-for="(faq, index) in faqs" :key="index" class="mb-4 accordion" :class="{ active: faq.open }">
        <div
          class="faq-header flex justify-between items-center px-4 py-2 cursor-pointer"
          @click="toggleFaq(index)"
        >
          <h3 class="text-2xl font-semibold">{{ faq.question }}</h3>
          <span>
            <!-- SVG для круга с крестом/плюсом с вращением -->
            <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24" class="faq-icon" :class="{ rotated: faq.open }">
              <circle cx="12" cy="12" r="11" fill="#98C850" stroke="none"></circle>
              <line x1="12" y1="6" x2="12" y2="18" stroke="white" stroke-width="2"></line>
              <line x1="6" y1="12" x2="18" y2="12" stroke="white" stroke-width="2"></line>
            </svg>
          </span>
        </div>
        <div v-if="faq.open" class="faq-body px-4 py-2 bg-light">
          <p>{{ faq.answer }}</p>
        </div>
      </div>
    </div>
  </section>
</template>

<script setup>
import { ref } from 'vue'

const faqs = ref([
  {
    question: 'Можно ли размещать рекламу в лифтах жилых домов?',
    answer: 'Размещение рекламы в лифтах через рекламное агентство «GreenWay» абсолютно законно. Со всеми собственниками жилых домов подписаны договора о сотрудничестве.',
    open: false
  },
  {
    question: 'Сколько стоит реклама в лифте?',
    answer: 'Стоимость размещения рекламы в лифтах жилых домов от 23 000₸ в месяц.\n\nТочная цифра зависит от:\nразмера рекламного модуля;\nрайона города (блока лифтов), где будет размещена реклама;\nпериода размещения',
    open: false
  },
  {
    question: 'Почему так дешево?',
    answer: 'Нет лишнего персонала. В нашем рекламном агентстве все мастера своего дела и работают с повышенной эффективностью;\nДоговора аренды лифтов без посредников непосредственно с самими собственниками имущества;',
    open: false
  },
  {
    question: 'Какой вид (размер) рекламы самый лучший?',
    answer: 'Предлагаем 6 видов рекламных модулей от формата А7 до формата А3.\nФормат А9 - частные объявления\n\nНаиболее оптимальным и востребованным является базовый формат А6 (14,8 х 10,5 = 155,4 см² )',
    open: false
  },
  {
    question: 'Сколько стоит разработка макета рекламы?',
    answer: 'Мы разрабатываем дизайн в подарок при каждом размещении, учитывая все пожелания заказчика',
    open: false
  },
  {
    question: 'Где будет моя реклама на плакате?',
    answer: 'Место размещения рекламы на плакате определяется дизайнером.\n\nУчитывается цветовая гамма, тематика рекламы и общий вид плаката.\n\nПодробности у наших менеджеров',
    open: false
  },
  {
    question: 'Возможно ли размещение рекламы по конкретным улицам или адресам?',
    answer: 'Наша адресная программа поделена на 3 блока.\n\nВ каждом блоке не менее 100 лифтов и проживает более 12 000 жителей.\n\nМенеджеры подбирают блоки лифтов оптимально соответствующие вашему запросу.\n\nСами блоки являются неделимыми',
    open: false
  },
  {
    question: 'Сроки выхода рекламы?',
    answer: 'Реклама в лифтах выходит ежемесячно:\n\nс 1-го по 5-ое число  блоке 3 \nс 15-го по 20-е число в блоках 1 и 2',
    open: false
  },
  {
    question: 'Сроки предоставления фотоотчета?',
    answer: 'Фотоотчет с фотографиями всех пронумерованных рекламных плакатов, размещенных в лифтах, предоставляется не позднее 5 (пяти) календарных дней с даты начала размещения рекламы в лифтах на электронную почту рекламодателя, указанную при заключении договора',
    open: false
  },
  {
    question: 'Когда можно начинать мониторить эффект от рекламы в лифтах?',
    answer: 'Развес рекламных плакатов в лифтах начинается с 1-го и с 15-го числа каждого месяца и длится не более 5 дней. Эффект от рекламы возможен уже с первого дня развеса, у всех по разному, тут угадать невозможно',
    open: false
  },
  {
    question: 'Где гарантия, что не будет обмана?',
    answer: 'Гарантия — это договор и отчет с фотографиями всех развешенных рекламных плакатов, направленный вам на электронную почту.\n\nКаждый плакат, размещенный в лифте, имеет свой уникальный номер и вы получите его фото',
    open: false
  },
  {
    question: 'Эффективность рекламы в лифтах жилых домов?',
    answer: 'Эффективность любой рекламы зависит от комплекса факторов. В первую очередь, это востребованность вашего товара или услуги на рынке и умение работать с клиентами.\n\nМы гарантируем качественное и эффективное исполнение своих обязанностей. Бизнес — это всегда риск, здесь мы рискуем вместе с вами.\n\nСамим себя хвалить неудобно. Вы можете посмотреть отзывы наших клиентов',
    open: false
  },
  {
    question: 'Кому подходит реклама в лифтах жилых домов?',
    answer: 'Всем, кто заинтересован привлечь новых клиентов в городе Караганда.\nЗа время нашей работы рекламой в лифтах пользовались:\n\nмедицинские организации, клиники и стоматологии;\nобразовательные услуги, детские кружки и секции;\nорганизации общественного питания, рестораны, бары, доставка еды;\nстроительные, логистические, производственные организации;\nсалоны красоты и барбершопы;\nторговые и развлекательные центры;\nфинансовые организации, банки и ломбарды;\nфитнес и спортивные секции',
    open: false
  },
  {
    question: 'Как разместить рекламу в лифтах жилых домов?',
    answer: 'Выбираете размер рекламного модуля, период и блок размещения;\nЗаключаете договор и производите оплату;\nУтверждаете дизайн рекламного модуля;\nПолучаете фотоотчёт и новых клиентов',
    open: false
  }
])

const toggleFaq = (index) => {
  faqs.value[index].open = !faqs.value[index].open
}
</script>

<style scoped>
.faq-section {
  background: #f3f4f6; /* светло-серый фон */
}

.text-primary {
  color: #333; /* основной цвет для текста */
}

.accordion {
  background: #e5e7eb; /* светлый серый фон аккордеона */
  border-radius: 4px;
  transition: transform 0.6s ease-in-out, box-shadow 0.6s ease-in-out;
  overflow: hidden;
  box-shadow: 0 0 15px rgba(0, 0, 0, 0.1);
}

.accordion.active {
  transform: scale(1.05);
  box-shadow: 0 0 15px rgba(0, 0, 0, 0.3);
}

.faq-header {
  font-size: 46px; /* увеличен шрифт для заголовков */
  color: #333;
  background: #f3f4f6;
  padding: 20px;
  cursor: pointer;
  transition: background 0.3s ease, color 0.3s ease;
}

.faq-header:hover {
  background-color: #98C850;
}

.faq-body {
  max-height: 0;
  opacity: 0;
  overflow: hidden;
  transition: max-height 0.6s ease, opacity 0.6s ease;
}

.accordion.active .faq-body {
  max-height: 500px; /* или любое максимальное значение, чтобы вместить текст */
  opacity: 1;
}

.faq-body p {
  padding: 20px;
  color: #4b5563; /* приглушённый серый для текста */
  font-size: 18px; /* увеличен размер текста для лучшей читаемости */
  animation: fadeIn 0.8s ease-in-out;
}

@keyframes fadeIn {
  0% { opacity: 0; transform: translateY(-10px); }
  100% { opacity: 1; transform: translateY(0); }
}

/* Иконка */
.faq-icon {
  width: 40px;
  height: 40px;
  transition: transform 0.4s ease-in-out;
}

/* Анимация вращения иконки при открытии */
.accordion.active .faq-icon {
  transform: rotate(45deg);
}
</style>